cf/InformationRegisters/Комментарии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>Комментарии</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вложения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КомментируемыеОбъекты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиОбъекта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/Комментарии/Forms/ДобавитьКомментарий/Ext/Form/Module.bsl
&НаСервере
Процедура ПроставитьЗначениИзПараметров(Имена, текПараметры)
	
	Имена = КонвертацияТипов.ПолучитьМассивИзСтроки(Имена);
	Для Каждого Имя Из Имена Цикл Если текПараметры.Свойство(Имя) И ЗначениеЗаполнено(текПараметры[Имя]) Тогда Запись[Имя] = текПараметры[Имя] КонецЕсли; КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПроставитьЗначениИзПараметров("СсылкаНаОбъект, Проект, ИмяРеквизита, НомерСтрокиОбъекта", Параметры);
	Заголовок = Запись.СсылкаНаОбъект;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Перем Текст, Вложения;
	
	ТекущийОбъект.Пользователь 	= ПараметрыСеанса.ТекущийПользователь;
	ТекущийОбъект.Период 		= ТекущаяДата();
	
	// Запихаем комментарий
	
	Комментарий.ПолучитьHTML(Текст, Вложения);
	
	ТекущийОбъект.Комментарий	= Текст;
	ТекущийОбъект.Вложения		= Новый ХранилищеЗначения(Вложения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОповеститьОЗаписиНового(Запись.СсылкаНаОбъект);
	
КонецПроцедуры
